# Pandas

Pandas is an open source, BSD-licensed library providing high performace, easy-to-use data structures and data analysis tools for the Python programming language

In [2]:
import pandas as pd
import numpy as np

In [8]:
df = pd.DataFrame(np.arange(0, 20).reshape(5,4), index = ['Row1', 'Row2','Row3','Row4','Row5'], columns = ['Column1', 'Column2', 'Column3', 'Column4'])

In [5]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [6]:
#convert the dataframe into an excel file
df.to_csv('Test1.csv')

In [10]:
#Accessing the elements
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int64

In [11]:
type(df.loc['Row1'])

pandas.core.series.Series

In [12]:
df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [13]:
type(df.iloc[:,1:])

pandas.core.frame.DataFrame

In [17]:
type(df.iloc[0:1,])

pandas.core.frame.DataFrame

In [23]:
df["Column1"]

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Column1, dtype: int64

In [24]:
type(df["Column1"])

pandas.core.series.Series

In [25]:
df[['Column3','Column4']]

      Column3  Column4
Row1        2        3
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19

In [18]:
#Converting dataframe into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [19]:
df.iloc[:,1:].values.shape

(5, 3)

In [20]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [21]:
df['Column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [22]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

# Read files

In [3]:
df = pd.read_csv('mercedesbenz.csv')

In [4]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [6]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [4]:
df = pd.read_csv('Test1.csv')

# csv

In [4]:
from io import StringIO

In [14]:
data = ('a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10,11,12')

In [15]:
type(data)

str

In [18]:
df = pd.read_csv(StringIO(data), dtype = object)
df.data

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [22]:
pd.read_csv(StringIO(data), usecols = ['c','a'])

   a   c
0  1   3
1  5   7
2  9  11

In [10]:
df.to_csv('Test1.csv')

In [23]:
df = pd.read_csv(StringIO(data), dtype={'b':int, 'c' : float, 'a' : 'Int64'})

In [24]:
df.dtypes

a      Int64
b      int64
c    float64
d      int64
dtype: object

In [25]:
df['a'][1]

5

In [36]:
data =('index, a, b, c\n'
      '4, apple, bat, 5.7\n'
      '8, orange, cow, 10')
df = pd.read_csv(StringIO(data), index_col = 0)
df

             a     b     c
index
4        apple   bat   5.7
8       orange   cow  10.0

In [38]:
data = ('a,b,c\n'
       '4,apple,bat,\n'
       '8,orange,cow,')
df = pd.read_csv(StringIO(data))
df

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [39]:
df = pd.read_csv(StringIO(data), index_col = False)
df

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [40]:
pd.read_csv(StringIO(data), usecols = ['b', 'c'], index_col = False)

        b    c
0   apple  bat
1  orange  cow

In [41]:
data = 'a,b\n"hello, \\"Bob\\", nice to see you",5'
pd.read_csv(StringIO(data), escapechar = '\\')

                               a  b
0  hello, "Bob", nice to see you  5

In [44]:
## URL to CSV
df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',
                 sep='\t')
df.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359

# Read JSON to CSV

In [10]:
Data='{"employe_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead","title2":"Sr. Developer"}]}'
df = pd.read_json(Data)
#nested information doesnot exactly appear as different columns
df

,employe_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [6]:

df= pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data', header=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [9]:
df.to_json()

'{"employe_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [11]:
df.to_json(orient = "records")

'[{"employe_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}]'

# Reading HTML Content

In [17]:
url = 'https://www.geeksforgeeks.org/python-list/' 
dfs = pd.read_html(url)
type(dfs)

list

In [18]:
type(dfs[0])

pandas.core.frame.DataFrame

In [20]:
url_mcc =  'https://en.wikipedia.org/wiki/Mobile_country_code' 
dfs=pd.read_html(url_mcc, match='Country', header=0)
dfs

[     Mobile country code                                    Country ISO 3166  \
 0                    289                                 A Abkhazia    GE-AB
 1                    412                                Afghanistan       AF
 2                    276                                    Albania       AL
 3                    603                                    Algeria       DZ
 4                    544  American Samoa (United States of America)       AS
 ..                   ...                                        ...      ...
 247                  452                                    Vietnam       VN
 248                  543                        W Wallis and Futuna       WF
 249                  421                                    Y Yemen       YE
 250                  645                                   Z Zambia       ZM
 251                  648                                   Zimbabwe       ZW

                                   Mobile network codes National MNC authority  \
 0             List of mobile network codes in Abkhazia                    NaN
 1          List of mobile network codes in Afghanistan                    NaN
 2              List of mobile network codes in Albania                    NaN
 3              List of mobile network codes in Algeria                    NaN
 4       List of mobile network codes in American Samoa                    NaN
 ..                                                 ...                    ...
 247        List of mobile network codes in the Vietnam                    NaN
 248  List of mobile network codes in Wallis and Futuna                    NaN
 249          List of mobile network codes in the Yemen                    NaN
 250             List of mobile network codes in Zambia                    NaN
 251           List of mobile network codes in Zimbabwe                    NaN

                       Remarks
 0    MCC is not listed by ITU
 1                         NaN
 2                         NaN
 3                         NaN
 4                         NaN
 ..                        ...
 247                       NaN
 248                       NaN
 249                       NaN
 250                       NaN
 251                       NaN

 [252 rows x 6 columns]]

# Read excel files

In [21]:
df_excel = pd.read_excel('Excel_Sample.xlsx')

FileNotFoundError: [Errno 2] No such file or directory: 'Excel_Sample.xlsx'

# Pickling

All pandas objects are equipped with to_pickle methods which use Python's cPickle module to save data structures to disk
using the pickle format.